#encoding=utf8
#Author:Li Ang

"""
字符编码          -ASCII 一个字符占一个字节  8位
GB2312 支持7000多个汉字----------GBK支持21000多个汉字--------------GBK18030支持27000多个汉字
Unicode 统一支持各国汉字
Unicode（统一码、万国码、单一码）是一种在计算机上使用的字符编码
Unicode中中文和英文的统一占两个字节 16位，    存储英文会占用大量的空间。
 UTF8    可变长的Unicode   ,存储英文时使用ASCII码存储，一个字符 占1个字节byte，存储中文时 一个字符占两个字节
"""
name = "你好 ，世界"
print (name)


 #单行注释使用开头
 #多行注释使用三个单引号或双引号


# 这里的引号可以用作注释，同时也可以用作打印多行
 #Example：
test = """
字符编码          -ASCII 一个字符占一个字节  8位
GB2312 支持7000多个汉字----------GBK支持21000多个汉字--------------GBK18030支持27000多个汉字
Unicode 统一支持各国汉字
Unicode（统一码、万国码、单一码）是一种在计算机上使用的字符编码
Unicode中中文和英文的统一占两个字节 16位，    存储英文会占用大量的空间。
UTF8    可变长的Unicode   ,存储英文时使用ASCII码存储，一个字符 占1个字节byte，存储中文时 一个字符占两个字节
"""
print(test)



#当参数有多行时 可使用单引号 双引号 表示，没有区别
test2 = "I am Li"
print(test2)
test3 = "I'am Li"
print(test3)

test4 = "'I'am Li"
print(test4)
#单引号和双引号可以随意使用